Enums/ВидыПродукцииИС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ВидыПродукцииИС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Алкогольная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Табак</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Обувь</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЛегкаяПромышленность</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МолочнаяПродукцияПодконтрольнаяВЕТИС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Шины</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Фотоаппараты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Духи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Велосипеды</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КреслаКоляски</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АльтернативныйТабак</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УпакованнаяВода</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МолочнаяПродукцияБезВЕТИС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Антисептики</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БАДы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НикотиносодержащаяПродукция</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Пиво</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПродукцияИзНатуральногоМеха</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Зерно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПродуктыПереработкиЗерна</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СоковаяПродукция</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БезалкогольноеПиво</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодконтрольнаяПродукцияВЕТИС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МорепродуктыПодконтрольныеВЕТИС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодконтрольнаяПродукцияСАТУРН</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗерноВЕТИС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПродуктыПереработкиЗернаВЕТИС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КормаДляЖивотныхПодконтрольныеВЕТИС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МясоПодконтрольноеВЕТИС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВетеринарныеПрепараты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИгрыИИгрушкиДляДетей</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РадиоэлектроннаяПродукция</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТитановаяМеталлопродукция</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КонсервированнаяПродукцияПодконтрольнаяВЕТИС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РастительныеМасла</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОптоволокноИОптоволоконнаяПродукция</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПарфюмерныеИКосметическиеСредстваИБытоваяХимия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КормаДляЖивотныхБезВЕТИС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КонсервированнаяПродукцияБезВЕТИС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПечатнаяПродукция</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СтроительныеМатериалы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтопительныеПриборы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Бакалея</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АлкогольнаяПродукцияДо9Процентов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТелефоныИНоутбуки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПиротехническиеИзделияИСредстваПожарнойБезопасности</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КабельнаяПродукция</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МоторныеМасла</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БезалкогольныеНапитки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПивоВПотребительскихУпаковках</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТехническиеСредстваРеабилитации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МедицинскиеИзделия</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CommonModules/ОбщегоНазначенияИСМПКлиентСерверПовтИсп/Ext/Module.bsl
#Область СлужебныйПрограммныйИнтерфейс

Функция ЭтоРасширеннаяВерсияГосИС() Экспорт
	
	Возврат ОбщегоНазначенияИСМПВызовСервера.ЭтоРасширеннаяВерсияГосИС();
	
КонецФункции

//Возвращает виды маркируемой продукции по которым ведется учет.
// Параметры:
//  ПродукцияИСМП - Булево - Будет добавлена продукция ИСМП
//  ПродукцияМОТП - Булево - Будет добавлена продукция МОТП
//Возвращаемое значение:
//   ФиксированныйМассив Из ПеречислениеСсылка.ВидыПродукцииИС - виды маркируемой продукции.
//
Функция УчитываемыеВидыМаркируемойПродукции(ПродукцияИСМП = Истина, ПродукцияМОТП = Истина) Экспорт
	
	ВидыМаркируемойПродукции = ОбщегоНазначенияИСМПВызовСервера.УчитываемыеВидыМаркируемойПродукции();
	
	Если ПродукцияИСМП И ПродукцияМОТП Тогда
		Возврат ВидыМаркируемойПродукции;
	КонецЕсли;
	
	ВидыПродукции = Новый Массив;
	
	Для Каждого ВидПродукции Из ВидыМаркируемойПродукции Цикл
		Если ПродукцияИСМП И ОбщегоНазначенияИСКлиентСервер.ЭтоПродукцияИСМП(ВидПродукции)
			Или ПродукцияМОТП И ОбщегоНазначенияИСКлиентСервер.ЭтоПродукцияМОТП(ВидПродукции) Тогда
			ВидыПродукции.Добавить(ВидПродукции);
		КонецЕсли;
	КонецЦикла;
	
	Возврат Новый ФиксированныйМассив(ВидыПродукции);
	
КонецФункции

//Возвращает виды маркируемой продукции в тестовом режиме на переданную дату.
//
//Параметры:
//   НаДату - Дата - дата оборота маркируемой продукции
//
//Возвращаемое значение:
//   ФиксированныйМассив Из ПеречислениеСсылка.ВидыПродукцииИС - виды маркируемой продукции, по которым установлен 
//   признак ведения учета и дата оборота менее даты обязательной регистрации.
//
Функция ВидыПродукцииОбязательнойМаркировки(НаДату) Экспорт
	
	Возврат ОбщегоНазначенияИСМПВызовСервера.УчитываемыеВидыМаркируемойПродукции(НаДату, Ложь);
	
КонецФункции

//Возвращает признак запроса данных из сервиса ИС МП.
//
//Возвращаемое значение:
//   Булево - Истина, в случае необходимости запроса данных сервиса.
//
Функция ЗапрашиватьДанныеСервиса() Экспорт
	
	Возврат ОбщегоНазначенияИСМПВызовСервера.ЗапрашиватьДанныеСервиса();

КонецФункции

// Возвращает признак включения режима работы с тестовым контуром ИС МП
//
// Возвращаемое значение:
//  Булево - Истина, если включен режим работы с тестовым контуром ИС МП.
//
Функция РежимРаботыСТестовымКонтуромИСМП() Экспорт
	
	Возврат ОбщегоНазначенияИСМПВызовСервера.РежимРаботыСТестовымКонтуромИСМП();
	
КонецФункции

// Возвращает настройки сканирования кодов маркировки ИС МП.
//
// Возвращаемое значение:
//  Булево - Истина, в случае необходимости контроля статусов.
Функция НастройкиСканированияКодовМаркировки() Экспорт
	
	Возврат ОбщегоНазначенияИСМПВызовСервера.НастройкиСканированияКодовМаркировки();

КонецФункции

// Возвращает признак возможности для вида продукции (и вида операции) участвовать в частичном выбытии.
// 
// Параметры:
//  ВидПродукции    - ПеречислениеСсылка.ВидыПродукцииИС                - вид маркируемой продукции.
//  ВидОперацииИСМП - ПеречислениеСсылка.ВидыОперацийИСМП, Неопределено - вид операции ИСМП.
// Возвращаемое значение:
//  Булево - Вид продукци (в текущей операции) может выбывать частично.
Функция ПоддерживаетсяЧастичноеВыбытие(ВидПродукции, ВидОперацииИСМП = Неопределено) Экспорт
	
	ПоддерживаетсяЧастичноеВыбытие = Ложь;
	
	Если ВидПродукции = ПредопределенноеЗначение("Перечисление.ВидыПродукцииИС.Духи")
		Или ВидПродукции = ПредопределенноеЗначение("Перечисление.ВидыПродукцииИС.АльтернативныйТабак")
		Или ВидПродукции = ПредопределенноеЗначение("Перечисление.ВидыПродукцииИС.НикотиносодержащаяПродукция")
		Или ВидПродукции = ПредопределенноеЗначение("Перечисление.ВидыПродукцииИС.Пиво")
		Или ВидПродукции = ПредопределенноеЗначение("Перечисление.ВидыПродукцииИС.ПивоВПотребительскихУпаковках")
		Или ВидПродукции = ПредопределенноеЗначение("Перечисление.ВидыПродукцииИС.БАДы") Тогда
		
		РозничныеОперации = НастройкаПараметровСканированияСлужебныйКлиентСерверПовтИсп.ОперацииРозничнойТорговли();
		
		Если ВидОперацииИСМП = Неопределено
			Или РозничныеОперации.Найти(ВидОперацииИСМП) <> Неопределено Тогда
			ПоддерживаетсяЧастичноеВыбытие = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ПоддерживаетсяЧастичноеВыбытие;
	
КонецФункции

Функция ЗапрашиватьДанныеЧастичногоВыбытияИзСервиса(ВидПродукции) Экспорт
	
	Если ВидПродукции = ПредопределенноеЗначение("Перечисление.ВидыПродукцииИС.Алкогольная") Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат ЗапрашиватьДанныеСервиса();
	
КонецФункции

//Возвращает признак необходимости контроля статусов кодов маркировок ИС МП при розничной торговле.
//
//Параметры:
//	 ВидПродукции - ПеречислениеСсылка.ВидыПродукцииИС - Вид продукции
//	 ВидОперации  - ПеречислениеСсылка.ВидыОперацийИСМП, Неопределено - Вид операции.
//Возвращаемое значение:
//   Булево - Истина, в случае необходимости контроля статусов.
//
Функция КонтролироватьСтатусыКодовМаркировкиВРознице(ВидПродукции = Неопределено, ВидОперации = Неопределено) Экспорт
	
	Если Не ЗапрашиватьДанныеСервиса() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ВидОперации) Тогда
		ОперацииКонтроля = Новый Массив();
		ОперацииКонтроля.Добавить(ВидОперации);
	Иначе
		ОперацииКонтроля = НастройкаПараметровСканированияСлужебныйКлиентСерверПовтИсп.ОперацииРозничнойТорговли();
	КонецЕсли;
	
	ОперацияИсключена = НастройкаПараметровСканированияСлужебныйКлиентСервер.ОперацииИсключеныИзКонтроляСтатусовИВладельцев(ОперацииКонтроля, ВидПродукции);
	
	Возврат Не (ОперацияИсключена);
	
КонецФункции

//Возвращает признак необходимости контроля статусов кодов маркировок ИС МП.
//
//Параметры:
//	 ВидПродукции - ПеречислениеСсылка.ВидыПродукцииИС - Вид продукции
//	 ВидОперации  - ПеречислениеСсылка.ВидыОперацийИСМП, Неопределено - Вид операции.
//
//Возвращаемое значение:
//   Булево - Истина, в случае необходимости контроля статусов
//
Функция КонтролироватьСтатусыКодовМаркировки(ВидПродукции = Неопределено, ВидОперации = Неопределено) Экспорт
	
	Если Не ЗапрашиватьДанныеСервиса() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ВидОперации) Тогда
		ОперацииКонтроля = Новый Массив();
		ОперацииКонтроля.Добавить(ВидОперации);
	Иначе
		ОперацииКонтроля = ОбщегоНазначенияКлиентСервер.РазностьМассивов(
			НастройкаПараметровСканированияСлужебныйКлиентСерверПовтИсп.ДопустимыеВидыОпераций().ВыгрузитьЗначения(),
			НастройкаПараметровСканированияСлужебныйКлиентСерверПовтИсп.ОперацииРозничнойТорговли());
	КонецЕсли;
	
	ОперацияИсключена = НастройкаПараметровСканированияСлужебныйКлиентСервер.ОперацииИсключеныИзКонтроляСтатусовИВладельцев(ОперацииКонтроля, ВидПродукции);
	
	Возврат Не (ОперацияИсключена);
	
КонецФункции

// Определяет признак учета в системе МРЦ.
// 
// Возвращаемое значение:
// 	Булево - Включено ведение учетаю
Функция УчитыватьМРЦ() Экспорт
	
	Возврат НастройкиСканированияКодовМаркировки().УчитыватьМРЦ;
	
КонецФункции

#Область РазрешительныйРежимРозничнойПродажи

// Возвращает признак включения режима проверки товарных групп при розничных продажах
//  методом codes/check в ГИС МТ
// 
// Возвращаемое значение:
//  Булево - Истина, если режим проверки кодов маркировки методом проверки в ГИС МТ кодов с криптохвостами включен
Функция ПроверкаТоварныхГруппПриРозничнойПродажеГИСМТ() Экспорт
	
	Возврат ОбщегоНазначенияИСМПКлиентСерверПовтИсп.НастройкиСканированияКодовМаркировки().ИспользоватьПроверкуРозничнымМетодомДляОпределенныхТоварныхГрупп;
	
КонецФункции

// Возвращает список продукции, по которой необходима онлайн-проверки при продаже на ККТ
// 
// Возвращаемое значение:
//  Массив из ПеречислениеСсылка.ВидыПродукцииИС- список продукции с обязательными проверками
//   перед продажей на кассе
Функция ВидыПродукцийОбязательнойОнлайнПроверкиПередРозничнойПродажей() Экспорт
	
	ВидыПродукцийСПроверкой = Новый Массив;
	ВидыПродукцийСПроверкой.Добавить(ПредопределенноеЗначение("Перечисление.ВидыПродукцииИС.АльтернативныйТабак"));
	ВидыПродукцийСПроверкой.Добавить(ПредопределенноеЗначение("Перечисление.ВидыПродукцииИС.Антисептики"));
	ВидыПродукцийСПроверкой.Добавить(ПредопределенноеЗначение("Перечисление.ВидыПродукцииИС.БАДы"));
	ВидыПродукцийСПроверкой.Добавить(ПредопределенноеЗначение("Перечисление.ВидыПродукцииИС.БезалкогольноеПиво"));
	ВидыПродукцийСПроверкой.Добавить(ПредопределенноеЗначение("Перечисление.ВидыПродукцииИС.Духи"));
	ВидыПродукцийСПроверкой.Добавить(ПредопределенноеЗначение("Перечисление.ВидыПродукцииИС.ЛегкаяПромышленность"));
	ВидыПродукцийСПроверкой.Добавить(ПредопределенноеЗначение("Перечисление.ВидыПродукцииИС.НикотиносодержащаяПродукция"));
	ВидыПродукцийСПроверкой.Добавить(ПредопределенноеЗначение("Перечисление.ВидыПродукцииИС.МолочнаяПродукцияПодконтрольнаяВЕТИС"));
	ВидыПродукцийСПроверкой.Добавить(ПредопределенноеЗначение("Перечисление.ВидыПродукцииИС.МолочнаяПродукцияБезВЕТИС"));
	ВидыПродукцийСПроверкой.Добавить(ПредопределенноеЗначение("Перечисление.ВидыПродукцииИС.Обувь"));
	ВидыПродукцийСПроверкой.Добавить(ПредопределенноеЗначение("Перечисление.ВидыПродукцииИС.СоковаяПродукция"));
	ВидыПродукцийСПроверкой.Добавить(ПредопределенноеЗначение("Перечисление.ВидыПродукцииИС.БезалкогольныеНапитки"));
	ВидыПродукцийСПроверкой.Добавить(ПредопределенноеЗначение("Перечисление.ВидыПродукцииИС.Пиво"));
	ВидыПродукцийСПроверкой.Добавить(ПредопределенноеЗначение("Перечисление.ВидыПродукцииИС.ПивоВПотребительскихУпаковках"));
	ВидыПродукцийСПроверкой.Добавить(ПредопределенноеЗначение("Перечисление.ВидыПродукцииИС.Табак"));
	ВидыПродукцийСПроверкой.Добавить(ПредопределенноеЗначение("Перечисление.ВидыПродукцииИС.УпакованнаяВода"));
	ВидыПродукцийСПроверкой.Добавить(ПредопределенноеЗначение("Перечисление.ВидыПродукцииИС.Фотоаппараты"));
	ВидыПродукцийСПроверкой.Добавить(ПредопределенноеЗначение("Перечисление.ВидыПродукцииИС.Шины"));
	
	Возврат ВидыПродукцийСПроверкой;
	
КонецФункции

// Проверка, подлежит ли продукция обязательной онлайн-проверке перед розничной продажей.
// 
// Параметры:
//  ВидПродукции - ПеречислениеСсылка.ВидыПродукцииИС - Вид продукции для проверки
//  ВидОперации - Неопределено, ПеречислениеСсылка.ВидыОперацийИСМП - Вид операции для проверки
//  ТребуетсяПроверкаСредствамиККТ - Булево - проверка на версию ФФД 1.2
// 
// Возвращаемое значение:
//  Булево - Продукция подлежит обязательной онлайн проверке перед розничной продажей
Функция ПродукцияПодлежитОбязательнойОнлайнПроверкеПередРозничнойПродажей(ВидПродукции, ВидОперации = Неопределено, ТребуетсяПроверкаСредствамиККТ = Истина) Экспорт

	ПродукцияПодлежитПроверке = Ложь;
	
	Если Не ТребуетсяПроверкаСредствамиККТ Тогда
		Возврат ПродукцияПодлежитПроверке;
	КонецЕсли;
	
	Если ВидОперации = Неопределено Тогда
		ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийИСМП.ВыводИзОборотаРозничнаяПродажа");
	ИначеЕсли Не ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийИСМП.ВыводИзОборотаРозничнаяПродажа") Тогда
		Возврат ПродукцияПодлежитПроверке;
	КонецЕсли;
	
	МассивПродукцийСПроверкой = ОбщегоНазначенияИСМПВызовСервера.СписокУчитываемойПродукцииТребующейОбязательнойПроверкиПриПродажеВРозницуНаДату();
	
	ПродукцияПодлежитПроверке = МассивПродукцийСПроверкой.Найти(ВидПродукции) <> Неопределено;
	
	Возврат ПродукцияПодлежитПроверке;

КонецФункции

Функция ВидыПродукцийСУчетомИсключений(ВидПродукции, ВидОперации) Экспорт
	
	МассивВидовПродукцийСУчетомИсключений = Новый Массив;
	УчитываемыеВидыМаркируемойПродукции = УчитываемыеВидыМаркируемойПродукции();
	
	Для Каждого ВидМаркируемойПродукции Из УчитываемыеВидыМаркируемойПродукции Цикл
	
		ВидПродукцииУчитывается = НастройкаПараметровСканированияСлужебныйКлиентСерверПовтИсп.КонтролироватьСтатусыКодовМаркировки(ВидПродукции, ВидОперации)
			Или НастройкаПараметровСканированияСлужебныйКлиентСерверПовтИсп.КонтролироватьВладельцевКодовМаркировки(ВидПродукции, ВидОперации);
		
		Если ВидПродукцииУчитывается Тогда
			МассивВидовПродукцийСУчетомИсключений.Добавить(ВидМаркируемойПродукции);
		КонецЕсли;
	
	КонецЦикла;
	
	Возврат МассивВидовПродукцийСУчетомИсключений;
	
КонецФункции

// Возвращает настройку частоты актуализации и загрузки CDN-площадок
//  для обращения к розничному методу продажи ГИС МТ
//
// Возвращаемое значение:
//  Число - частота обновления, в часах
Функция ЧастотаОбновленияCDNПлощадок() Экспорт
	
	Возврат ОбщегоНазначенияИСМПВызовСервера.НастройкиСканированияКодовМаркировки().ЧастотаОбновленияCDNПлощадок;
	
КонецФункции

// Возвращает настройку времени ожидания ответа от ГИС МТ при пробитии чека
//  при работе с разрешительным режимом
// 
// Возвращаемое значение:
//  Число - время ожидания ответа от CDN-площадок при пробитии чека, в секундах
Функция ВремяОтветаCDNПлощадокПриПробитииЧека() Экспорт
	
	Возврат ОбщегоНазначенияИСМПВызовСервера.НастройкиСканированияКодовМаркировки().ВремяОтветаCDNПлощадокПриПробитииЧека;
	
КонецФункции

// Возвращает настройку времени действия идентификатора разрешительного режима при
//  розничной продаже, после истечение времени идентификатор требуется обновить и переполучить
// 
// Возвращаемое значение:
//  Число - срок действия идентификатора, в секундах
Функция СрокДействияИдентификатораНаПродажуРазрешительногоРежима() Экспорт
	
	Возврат ОбщегоНазначенияИСМПВызовСервера.НастройкиСканированияКодовМаркировки().СрокДействияИдентификатораРазрешительногоРежима;
	
КонецФункции

// Возвращает настройку времени блокировки CDN-площадок при их некорретных ответах
//  при работе с разрешительным режимом
// 
// Возвращаемое значение:
//  Число - время блокировки CDN-площадок, в минутах
Функция ВремяБлокировкиCDNПлощадки() Экспорт
	
	Возврат ОбщегоНазначенияИСМПВызовСервера.НастройкиСканированияКодовМаркировки().ВремяБлокировкиCDNПлощадок;
	
КонецФункции

// Возвращает признак действия аварийного режима при розничных продажах
//  Запросы разрешительного режима не выполняются, их результаты не контролируются
// 
// Возвращаемое значение:
//  Булево - Истина, если аварийный режим включен
Функция ДействуетАварийныйРежимДляРозничныхПродаж() Экспорт
	
	Возврат ОбщегоНазначенияИСМПВызовСервера.ДействуетАварийныйРежимДляРозничныхПродаж();
	
КонецФункции

// Возвращает код ответа, зафиксированный ГИС МТ как код ответа, означающий наступление аварийного режима
// 
// Возвращаемое значение:
//  Число - Код ответа аварийного режима
Функция АварийныйРежимКодОтветаСервисаГИСМТ() Экспорт
	
	Возврат 203;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Возвращает редакцию библиотеки подключаемого оборудования(БПО).
// В редакции 2 данные возвращаются как первый элемент массива, возращаемого в свойстве ВыходныеПараметры.
// В редакции 3 данные возвращаются в составе возвращаемого значение.
// 
// Возвращаемое значение:
//  Число - Редакция БПО. Первая цифра номера версии.
Функция РедакцияБПО() Экспорт
	
	ВерсияБиблиотеки = МенеджерОборудованияВызовСервера.ВерсияБиблиотеки();
	
	Возврат Число(СтрРазделить(ВерсияБиблиотеки, ".")[0]);
	
КонецФункции

#КонецОбласти
